backend/load-tests.yml
config:
  target: "http://localhost:5000/api"
  phases:
    - duration: 30
      arrivalRate: 3
      name: "100 Users Scale (burst)"
    - duration: 30
      arrivalRate: 16
      name: "500 Users Scale (burst)"
    - duration: 30
      arrivalRate: 33
      name: "1,000 Users Scale (burst)"
    - duration: 30
      arrivalRate: 166
      name: "5,000 Users Scale (burst)"
  variables:
    randomQuery:
      - "wedding"
      - "haldi"
      - "floral decor"
      - "mandap"
      - "lights"
scenarios:
  - name: "Browse Products"
    flow:
      - get:
          url: "/products"
      - think: 1
      - get:
          url: "/products/categories"
  - name: "Search Performance"
    flow:
      - get:
          url: "/search?q={{ randomQuery }}"
      - think: 2
      - get:
          url: "/search/autocomplete?q=we"
  - name: "Checkout Flow"
    flow:
      - post:
          url: "/orders/cart/sync"
          json:
            items:
              - productId: "662f1a2b3c4d5e6f7a8b9c0d"
                quantity: 1
      - think: 2
      - post:
          url: "/orders/checkout"
          json:
            items:
              - productId: "662f1a2b3c4d5e6f7a8b9c0d"
                quantity: 1
            deliveryDate: "2030-10-10"
            deliveryTime: "Morning"
            address: "123 Test St"
  - name: "Concurrent Upload Simulation"
    flow:
      - post:
          url: "/admin/products/upload-temp"
          headers:
            Authorization: "Bearer ADMIN_TEST_TOKEN"
          formData:
            images: 
              fromFile: "./test-image.jpg"